<a href="https://colab.research.google.com/github/Shivansh010/Titanic-Dataset/blob/main/Titanic.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt

In [ ]:
from google.colab import files

uploaded = files.upload() # Here we will upload the csv files for this problem

for fn in uploaded.keys():
  print('You uploaded file "{name}" with length {length} bytes'.format(name=fn, length=len(uploaded[fn])))

Saving test.csv to test.csv
Saving train.csv to train.csv
You uploaded file "test.csv" with length 28629 bytes
You uploaded file "train.csv" with length 61194 bytes

In [ ]:
df_train = pd.read_csv("train.csv")
df_train.head()

   PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
0            1         0       3  ...   7.2500   NaN         S
1            2         1       1  ...  71.2833   C85         C
2            3         1       3  ...   7.9250   NaN         S
3            4         1       1  ...  53.1000  C123         S
4            5         0       3  ...   8.0500   NaN         S

[5 rows x 12 columns]

In [ ]:
df_test = pd.read_csv("test.csv")
df_test.head()

   PassengerId  Pclass  ... Cabin Embarked
0          892       3  ...   NaN        Q
1          893       3  ...   NaN        S
2          894       2  ...   NaN        Q
3          895       3  ...   NaN        S
4          896       3  ...   NaN        S

[5 rows x 11 columns]

In [ ]:
# Check for diverse values in training data
for col in df_train.columns.values:
  list_vals=pd.unique(df_train[col])
  print(col + ' is of type ' + str(df_train[col].dtype) + ', has ' + str(len(list_vals)) + ' unique values and ' + str(df_train[col].isna().sum()) +' null values' )
  if len(list_vals) < 10:
    list_str=''
    for n_value in range(0,len(list_vals)):
      list_str=list_str+str(list_vals[n_value])+ ', '
    print('  These are: '+list_str[0:len(list_str)-2])

PassengerId is of type int64, has 891 unique values and 0 null values
Survived is of type int64, has 2 unique values and 0 null values
  These are: 0, 1
Pclass is of type int64, has 3 unique values and 0 null values
  These are: 3, 1, 2
Name is of type object, has 891 unique values and 0 null values
Sex is of type object, has 2 unique values and 0 null values
  These are: male, female
Age is of type float64, has 89 unique values and 177 null values
SibSp is of type int64, has 7 unique values and 0 null values
  These are: 1, 0, 3, 4, 2, 5, 8
Parch is of type int64, has 7 unique values and 0 null values
  These are: 0, 1, 2, 5, 3, 4, 6
Ticket is of type object, has 681 unique values and 0 null values
Fare is of type float64, has 248 unique values and 0 null values
Cabin is of type object, has 148 unique values and 687 null values
Embarked is of type object, has 4 unique values and 2 null values
  These are: S, C, Q, nan

In [ ]:
df_train["Sex"] = np.where(df_train["Sex"].str.contains("female"), 1, 0)

In [ ]:
df_train['Age'] = df_train['Age'].replace(np.nan, df_train['Age'].mean())

In [ ]:
df_train["Embarked"].value_counts()

S    644
C    168
Q     77
Name: Embarked, dtype: int64

In [ ]:
df_train['Embarked'] = df_train['Embarked'].replace(np.nan, 'S')

In [ ]:
y = pd.get_dummies(df_train.Embarked, prefix='Embarked')

In [ ]:
df_train = pd.merge(df_train, y, left_index=True, right_index=True)

In [ ]:
df_train.head()

   PassengerId  Survived  Pclass  ... Embarked_C  Embarked_Q  Embarked_S
0            1         0       3  ...          0           0           1
1            2         1       1  ...          1           0           0
2            3         1       3  ...          0           0           1
3            4         1       1  ...          0           0           1
4            5         0       3  ...          0           0           1

[5 rows x 15 columns]

In [ ]:
features = ['Pclass','Sex','Age','SibSp','Parch','Fare','Embarked_C','Embarked_Q','Embarked_S']

In [ ]:
X_train = df_train[features]
Y_train = df_train['Survived']

In [ ]:
from sklearn.model_selection import GridSearchCV
from sklearn.ensemble import RandomForestClassifier

print('Training Random Forest Classifier using GridSearchCV')

scoring='f1' # Criterain for model selection is f1

model = RandomForestClassifier(random_state=0)

hyperparameters = {'max_depth':[2,5,10,20],'n_estimators':[10,30,100,150,200]}

clf = GridSearchCV(estimator=model, param_grid=hyperparameters, scoring=scoring)
clf.fit(X_train,Y_train)

print('Best parameters:')
print(clf.best_params_)
print('Best f1 score: '+ str(abs(clf.best_score_)))

Training Random Forest Classifier using GridSearchCV
Best parameters:
{'max_depth': 10, 'n_estimators': 150}
Best f1 score: 0.7705686635443372

In [ ]:
# Check for diverse values in training data
for col in df_test.columns.values:
  list_vals=pd.unique(df_test[col])
  print(col + ' is of type ' + str(df_test[col].dtype) + ', has ' + str(len(list_vals)) + ' unique values and ' + str(df_test[col].isna().sum()) +' null values' )
  if len(list_vals) < 10:
    list_str=''
    for n_value in range(0,len(list_vals)):
      list_str=list_str+str(list_vals[n_value])+ ', '
    print('  These are: '+list_str[0:len(list_str)-2])

PassengerId is of type int64, has 418 unique values and 0 null values
Pclass is of type int64, has 3 unique values and 0 null values
  These are: 3, 2, 1
Name is of type object, has 418 unique values and 0 null values
Sex is of type object, has 2 unique values and 0 null values
  These are: male, female
Age is of type float64, has 80 unique values and 86 null values
SibSp is of type int64, has 7 unique values and 0 null values
  These are: 0, 1, 2, 3, 4, 5, 8
Parch is of type int64, has 8 unique values and 0 null values
  These are: 0, 1, 3, 2, 4, 6, 5, 9
Ticket is of type object, has 363 unique values and 0 null values
Fare is of type float64, has 170 unique values and 1 null values
Cabin is of type object, has 77 unique values and 327 null values
Embarked is of type object, has 3 unique values and 0 null values
  These are: Q, S, C

In [ ]:
df_test["Sex"] = np.where(df_test["Sex"].str.contains("female"), 1, 0)

In [ ]:
df_test['Age'] = df_test['Age'].replace(np.nan, df_test['Age'].mean())

In [ ]:
df_test['Fare'] = df_test['Fare'].replace(np.nan, df_test['Fare'].mean())

In [ ]:
y_test = pd.get_dummies(df_test.Embarked, prefix='Embarked')

In [ ]:
df_test = pd.merge(df_test, y, left_index=True, right_index=True)

In [ ]:
df_test.head()

   PassengerId  Pclass  ... Embarked_Q  Embarked_S
0          892       3  ...          0           1
1          893       3  ...          0           0
2          894       2  ...          0           1
3          895       3  ...          0           1
4          896       3  ...          0           1

[5 rows x 14 columns]

In [ ]:
X_test = df_test[features] 
X_test

     Pclass  Sex       Age  SibSp  ...      Fare  Embarked_C  Embarked_Q  Embarked_S
0         3    0  34.50000      0  ...    7.8292           0           0           1
1         3    1  47.00000      1  ...    7.0000           1           0           0
2         2    0  62.00000      0  ...    9.6875           0           0           1
3         3    0  27.00000      0  ...    8.6625           0           0           1
4         3    1  22.00000      1  ...   12.2875           0           0           1
..      ...  ...       ...    ...  ...       ...         ...         ...         ...
413       3    0  30.27259      0  ...    8.0500           0           0           1
414       1    1  39.00000      0  ...  108.9000           0           0           1
415       3    0  38.50000      0  ...    7.2500           0           0           1
416       3    0  30.27259      0  ...    8.0500           0           0           1
417       3    0  30.27259      1  ...   22.3583           0           0           1

[418 rows x 9 columns]

In [ ]:
df_test['Survived'] = clf.predict(X_test)

In [ ]:
submission = df_test[['PassengerId','Survived']]

In [ ]:
submission.to_csv('submission.csv',index=False)

In [ ]:
from google.colab import files
files.download("submission.csv")